# Datenbanken mit SQLite

[SQLite-Docu](https://www.sqlite.org/lang.html) <br>
Web-Client: [Sqlite Browser](https://sqliteonline.com/)    <br>
Beispieldatenbank: [Sportverein](sportverein.db)

Downloade die Sportverein-Datenbank, lade die Datenbank dann in den Web-Client mit File-OpenDB.

#### SQL-Abfragen

#### Sportverein
Ein Sportverein hat Mitglieder, die eine oder mehrere Sportarten üben wollen. Dazu sind Übungsgruppen eingerichtet worden, die einen Leiter haben, der auch Mitglied im Sportverein ist. Für jede Übungsgruppe gibt es eine oder mehrere Trainingszeiten pro Woche, zu denen die Gruppe an eventuell verschiedenen Trainingsorten übt. Die Dauer einer Trainingszeit beträgt eine Stunde. Hausmeister betreuen einen oder mehrere Trainingsorte. Die Mitglieder zahlen einen bestimmten Betrag und haben deshalb ihr Bankverbindung angegeben.

<img src='sportverein.png'>

In [26]:
import sqlite3 as sq
import sportverein
sportverein.createDB()

def abfrage(sql):
    '''
    sql: String mit SQL-Anweisung
    returns: None, printed die Ergebniszeilen
    '''
    connection = sq.connect("sportverein.db")  
    cursor = connection.cursor()
    
    cursor.execute(sql)
    connection.commit()
    if sql.strip().startswith("SELECT"):      # die namen der felder ausgeben
        cols =  [x[0] for x in cursor.description]
        n = sum([len(x) for x in cols])+len(cols)
        print(*cols)
        print('-'*n)

    for zeile in cursor:
        print(*zeile)
    connection.close()

In [5]:
sql = "SELECT * FROM uebungsgruppe"
abfrage(sql)

uid sportart mid
-----------------
1 Schwimmen 1990
2 Fußball 2010
3 Tennis 2229
4 Volleyball 2832
5 Wasserball 1990
6 Tauchen 2595
7 Basketball 2577
8 Turnen 2643
9 Langlauf 2349
10 Fußball 1977
11 Volleyball 1993
12 Schwimmen 2173
13 Fußball 2010
14 Volleyball 1993
15 Fußball 2189
16 Schwimmen 2638
17 Fußball 2632

In [45]:
sql = "SELECT DISTINCT sportart FROM uebungsgruppe"
abfrage(sql)

sportart
---------
Schwimmen
Fußball
Tennis
Volleyball
Wasserball
Tauchen
Basketball
Turnen
Langlauf

In [6]:
sql = "SELECT COUNT(DISTINCT sportart) FROM uebungsgruppe"
abfrage(sql)

COUNT(DISTINCT sportart)
-------------------------
9

Mit der **WHERE**-Klausel können wir Bedingungen formulieren.

In [7]:
sql = "SELECT * FROM uebungsgruppe  WHERE sportart = 'Fußball'"
abfrage(sql)

uid sportart mid
-----------------
2 Fußball 2010
10 Fußball 1977
13 Fußball 2010
15 Fußball 2189
17 Fußball 2632

In [7]:
# Vergleichsoperator 
sql = "SELECT mid, name FROM mitglied  WHERE mid < 1970"
abfrage(sql)

mid name
---------
1963 Giek
1964 Kiefer
1965 Voss
1966 Matthies
1967 Krey
1968 Rehbock
1969 Siebert

In [8]:
# Between
sql = "SELECT mid, name FROM mitglied WHERE mid BETWEEN 1964 AND 1967"
abfrage(sql)

mid name
---------
1964 Kiefer
1965 Voss
1966 Matthies
1967 Krey

In [9]:
# Like mit wildcard %
sql = "SELECT mid, name FROM mitglied WHERE name LIKE 'Ki%'"
abfrage(sql)

mid name
---------
1964 Kiefer
1975 Kinner
2001 Kirchner
2568 Kilian
2638 Kistner
2897 Kistner

In [10]:
# Like mit wildcard _
sql = "SELECT mid, name FROM mitglied WHERE name LIKE '__a__'"
abfrage(sql)

mid name
---------
2232 Braun
2339 Kraus
2481 Kraft
2736 Staps
2872 Kraft

In [11]:
# logische Operatoren
sql = "SELECT mid, name FROM mitglied WHERE name LIKE 'A%' AND (mid < 2000 OR mid > 2800)"
abfrage(sql)

mid name
---------
1970 Auffarth
2823 Aebersold
2859 Adolphy
2873 Alt
2921 Autenrieth
2940 Andres

In [12]:
# order by
sql = "SELECT * FROM uebungsgruppe ORDER BY sportart"
abfrage(sql)

uid sportart mid
-----------------
7 Basketball 2577
2 Fußball 2010
10 Fußball 1977
13 Fußball 2010
15 Fußball 2189
17 Fußball 2632
9 Langlauf 2349
1 Schwimmen 1990
12 Schwimmen 2173
16 Schwimmen 2638
6 Tauchen 2595
3 Tennis 2229
8 Turnen 2643
4 Volleyball 2832
11 Volleyball 1993
14 Volleyball 1993
5 Wasserball 1990

In [13]:
# order by ... desc
sql = "SELECT * FROM uebungsgruppe WHERE mid > 2500 ORDER BY sportart DESC"
abfrage(sql)

uid sportart mid
-----------------
4 Volleyball 2832
8 Turnen 2643
6 Tauchen 2595
16 Schwimmen 2638
17 Fußball 2632
7 Basketball 2577

In [14]:
# limit
sql = "SELECT * FROM mitglied WHERE mid > 2500 LIMIT 10"
abfrage(sql)

mid name vorname telefon konto blz beitrag
-------------------------------------------
2502 Tramski Werner 0041-31-8293110 31277895 18750023 52.0
2503 Bäz Peter 09324-693 87592808 75000092 34.0
2504 Hämmerle Jo  72328166 37500046 17.0
2505 Messner Klaus P. 0421-36116776 19491420 18750023 52.0
2506 Kunze Michael 06132-99510 92310756 37500046 34.0
2507 Friebe Herr 0611-317210 66889770 18750023 52.0
2508 Wolff Werner  16379051 37500046 17.0
2509 Lohr Claudia 07274-1060 82726781 37500046 17.0
2510 Welte Eckhard 02351-95930 89010877 56250069 34.0
2511 Frankerl Wolfgang 07131-562452 5817857 56250069 52.0

In [15]:
# sql functions min, max, count
sql = "SELECT MIN(mid), MAX(mid), MAX(mid)-MIN(mid), COUNT(mid) FROM mitglied"
abfrage(sql)

MIN(mid) MAX(mid) MAX(mid)-MIN(mid) COUNT(mid)
-----------------------------------------------
1963 2943 980 930

In [16]:
# sql functions avg, sum
sql = "SELECT AVG(beitrag), SUM(beitrag) FROM mitglied"
abfrage(sql)

AVG(beitrag) SUM(beitrag)
--------------------------
34.11827956989247 31730.0

In [17]:
# In
sql = "SELECT * FROM uebungsgruppe WHERE sportart IN ('Fußball','Schwimmen')"
abfrage(sql)

uid sportart mid
-----------------
1 Schwimmen 1990
2 Fußball 2010
10 Fußball 1977
12 Schwimmen 2173
13 Fußball 2010
15 Fußball 2189
16 Schwimmen 2638
17 Fußball 2632

In [18]:
# subquery - die Namen der Übungsgruppenleiter
sql = "SELECT name FROM mitglied WHERE mid IN (SELECT mid FROM uebungsgruppe)"
abfrage(sql)

name
-----
Schinkmann
Rienhöfer
Ellerbusch
Böttcher
Weinert
Roth
Rudolph
Zwick
Müller
Liesch
Freyer
Kistner
Arndt
Wolf

In [19]:
# Aliasse für Spalten
sql = "SELECT name n, mid m FROM mitglied WHERE n LIKE 'A%' and m > 2500"
abfrage(sql)

n m
----
Anlauf 2579
Arndt 2643
Aluttis 2700
Aluttis 2734
Aebersold 2823
Adolphy 2859
Alt 2873
Autenrieth 2921
Andres 2940

In [15]:
# Kreuzprodukt
sql = "SELECT name, ort FROM hausmeister, trainingsort"
abfrage(sql)

name ort
---------
Krause Bad1
Krause Bad2
Krause Bad3
Krause Halle1
Krause Halle2
Krause Halle3
Krause Platz1
Krause Platz2
Koschulte Bad1
Koschulte Bad2
Koschulte Bad3
Koschulte Halle1
Koschulte Halle2
Koschulte Halle3
Koschulte Platz1
Koschulte Platz2
Kacmarek Bad1
Kacmarek Bad2
Kacmarek Bad3
Kacmarek Halle1
Kacmarek Halle2
Kacmarek Halle3
Kacmarek Platz1
Kacmarek Platz2

In [19]:
# Aliasse für Tabellen
sql = "SELECT a.name, b.name FROM hausmeister a, mitglied b LIMIT(10)"
abfrage(sql)

name name
----------
Krause Giek
Krause Kiefer
Krause Voss
Krause Matthies
Krause Krey
Krause Rehbock
Krause Siebert
Krause Auffarth
Krause Klein
Krause Bartussek

In [20]:
# die Verbindung über die WHERE-Klausel
sql = "SELECT a.name, b.ort FROM hausmeister a, trainingsort b WHERE a.hid = b.hid"
abfrage(sql)

name ort
---------
Krause Bad1
Koschulte Bad2
Koschulte Bad3
Koschulte Halle1
Koschulte Halle2
Kacmarek Halle3
Kacmarek Platz1
Krause Platz2

In [23]:
# besser: die Verbindung über JOIN
sql = """
SELECT a.name, b.ort FROM hausmeister a 
JOIN trainingsort b ON b.hid = a.hid
"""
abfrage(sql)

name ort
---------
Krause Bad1
Koschulte Bad2
Koschulte Bad3
Koschulte Halle1
Koschulte Halle2
Kacmarek Halle3
Kacmarek Platz1
Krause Platz2

In [27]:
# Join - liste die Namen aller Übungsleiter in Halle1
sql = """
SELECT a.name FROM mitglied a 
JOIN uebungsgruppe b ON b.mid = a.mid
JOIN trainingseinheit c ON c.uid = b.uid
JOIN trainingsort d ON d.ort = c.ort
WHERE d.ort = "Halle1"
"""
abfrage(sql)

name
-----
Müller
Ellerbusch

In [54]:
# GROUP BY wird oft mit den Aggregatfunktionen (COUNT, MAX, MIN, SUM, AVG) benutzt
sql = "SELECT blz, COUNT(blz) FROM mitglied GROUP BY blz"
abfrage(sql)

blz COUNT(blz)
---------------
18750023 186
37500046 166
56250069 196
75000092 201
93750115 181

In [56]:
# Absteigend sortiert: Wieviele Mitglieder sind bei welcher Bank
sql = """
SELECT COUNT(a.blz) zaehl, b.bezeichnung FROM mitglied a
JOIN bank b ON b.blz = a.blz
GROUP BY a.blz ORDER BY zaehl DESC
"""
abfrage(sql)

zaehl bezeichnung
------------------
201 Sparkasse Rhynern
196 Volksbank Unna
186 Volksbank Mawicke
181 Deutsche Bank Soest
166 Sparkasse Echthausen

In [28]:
# HAVING ersetzt das WHERE bei Aggregatfunktionen.
# Liste alle sportarten, die mehr als einen Übungsleiter haben
sql = "SELECT COUNT(mid), sportart FROM uebungsgruppe GROUP BY sportart HAVING count(mid) > 1"
abfrage(sql)

COUNT(mid) sportart
--------------------
5 Fußball
3 Schwimmen
3 Volleyball